package com.galacticware.griddle.domain.model.language

/**
 * Enumeration of languages that have a supported keyboard layer
 * (and a corresponding LayerDefinition).
 */
enum class LanguageTag(
    val label: String,
    val accentedCharacters: List<List<String >> = emptyList(),
    val isImplemented: Boolean = false
) {
    ENGLISH("English",
        listOf(
            listOf("a", "ǎ", "â", "à", "á", "ã", "ä", "å", "æ"),
            listOf("n", "ň", "ñ"),
            listOf("l", "ľ", "₤"),
            listOf("i", "ǐ", "ı", "î", "ì", "í", "ï"),
            listOf("h", "ĥ"),
            listOf("k", "ǩ"),
            listOf("o", "œ", "¤", "©", "č", "ĉ", "ç", "ć"),
            listOf("u", "ǔ", "û", "ù", "ú", "ü", "ů", "ŭ"),
            listOf("p", "¶", "₧"),
            listOf("j", "ĵ"),
            listOf("ď", "ð"),
            listOf("g", "ǧ", "ĝ"),
            listOf("c", "¢", "©", "č", "ĉ", "ç", "ć"),
            listOf("r", "ř"),
            listOf("t", "ť", "ţ"),
            listOf("e", "ě", "ê", "è", "é", "ë"),
            listOf("w", "ŵ"),
            listOf("z", "ž", "ẑ"),
            listOf("s", "š", "ş", "ŝ", "ß", "∫"),
            listOf("f", "ƒ", "₣")
        ),
        isImplemented = true
    ),
    FRENCH("French",
        listOf(
            listOf("a", "à", "â", "æ", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        ),
        isImplemented = true
    ),
    GERMAN("German",
        listOf(
            listOf("a", "ä", "à", "á", "â", "ã", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    SPANISH("Spanish",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    ITALIAN("Italian",
        listOf(
            listOf("a", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    PORTUGUESE("Portuguese",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    DUTCH("Dutch",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    POLISH("Polish",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    CZECH("Czech",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    SLOVAK("Slovak",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    HUNGARIAN("Hungarian",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    ROMANIAN("Romanian",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
            listOf("u", "û", "ù", "ü", "ū", "ú", "ų", "ů"),
            listOf("y", "ÿ", "ý", "ỳ", "ŷ"),
            listOf("z", "ž", "ź", "ż")
        )
    ),
    /*
    ㄔ

    * */
    MANDARIN("Mandarin",
        listOf(
            listOf(
                "ㄕ", "ㄓ", "ŋ", "ɲ", "ɳ", "ɴ", "ɱ", "ɰ", "ɯ", "ɮ", "ɭ", "ɬ", "ɫ", "ɪ", "ɩ", "ɨ", "ɧ", "ɦ", "ɥ", "ɤ", "ɣ", "ɢ", "ɡ", "ɠ", "ɟ", "ɞ", "ɝ", "ɜ", "ɛ", "ɚ", "ɘ", "ɗ", "ɖ", "ɕ", "ɔ", "ɓ", "ɒ", "ɑ", "ɐ", "ɏ", "Ɏ", "ɍ", "Ɍ", "ɋ", "Ɋ", "ɉ", "Ɉ", "ɇ", "Ɇ", "Ʌ", "Ʉ", "Ƀ", "ɂ", "Ɂ", "ɀ", "ɿ", "ɾ", "ɽ", "ɼ", "ɻ", "ɺ", "ɹ", "ɸ", "ɷ", "ɶ", "ɵ", "ɴ", "ɳ", "ɲ", "ɱ", "ɰ", "ɯ", "ɮ", "ɭ", "ɬ", "ɫ", "ɪ", "ɩ", "ɨ", "ɧ", "ɦ", "ɥ", "ɤ", "ɣ", "ɢ", "ɡ", "ɠ", "ɟ", "ɞ", "ɝ", "ɜ", "ɛ", "ɚ", "ɘ", "ɗ", "ɖ", "ɕ", "ɔ", "ɓ", "ɒ", "ɑ", "ɐ", "ɏ", "Ɏ", "ɍ", "Ɍ", "ɋ", "Ɋ", "ɉ", "Ɉ", "ɇ", "Ɇ", "Ʌ", "Ʉ", "Ƀ", "ɂ", "Ɂ", "ɀ", "ɿ", "ɾ", "ɽ", "ɼ", "ɻ", "ɺ", "ɹ", "ɸ", "ɷ", "ɶ",
            ),
        )
    ),
    SWAHILI("Swahili",
        listOf(
            listOf("a", "á", "à", "â", "ã", "ä", "å", "ā", "ă", "ą"),
            listOf("c", "ç", "ć", "č"),
            listOf("e", "é", "è", "ê", "ë", "ē", "ė", "ę"),
            listOf("i", "î", "ï", "í", "ì", "ī", "į", "ı"),
            listOf("l", "ł"),
            listOf("n", "ñ", "ń", "ň"),
            listOf("o", "œ", "ø", "õ", "ô", "ö", "ō", "ó", "ò"),
            listOf("s", "ß", "ś", "š", "ş"),
        )
    )
    ;

    data class UserLanguageData(
        val primaryLanguageTag: LanguageTag,
        val languageTags: Set<LanguageTag>,
        val currentLanguageTag: LanguageTag
    )
}